#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
random_id.bucket_id: Refreshing state... [id=1NQhVYR7gkQ]
data.google_client_config.provider: Reading...
google_storage_bucket.tf_state_bucket: Refreshing state... [id=terraform-state-d4d42155847b8244]
google_container_cluster.prod_cluster: Refreshing state... [id=projects/hackathon-climat-05/locations/europe-west1/clusters/prod-cluster]
data.google_client_config.provider: Read complete after 0s [id=projects/hackathon-climat-05/regions//zones/]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # helm_release.argocd will be created
  + resource "helm_release" "argocd" {
      + atomic                     = false
      + chart                      = "argo-cd"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "argo-cd"
      + namespace                  = "argocd"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://argoproj.github.io/argo-helm"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                "controller":
                  "enableStatefulSet": true
                "redis-ha":
                  "enabled": true
                "repoServer":
                  "autoscaling":
                    "enabled": true
                    "minReplicas": 2
                "server":
                  "autoscaling":
                    "enabled": true
                    "minReplicas": 2
            EOT,
        ]
      + verify                     = false
      + version                    = "4.9.7"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # kubernetes_namespace.argocd_namespace will be created
  + resource "kubernetes_namespace" "argocd_namespace" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "argocd"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @au2001, Action: `pull_request`*